Revit 2027 API
OptionalFunctionalityUtils.IsDGNImportLinkAvailable Method
 Checks whether the DGN Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDGNImportLinkAvailable()
Public Shared Function IsDGNImportLinkAvailable As Boolean
public:
static bool IsDGNImportLinkAvailable()
static member IsDGNImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the DGN Import/Link functionality is available in the installed Revit.
Remarks
 DGN Import/Link is optional functionality that does not have to be part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace